app/controllers/api/garden_controller.rb

INSERT INTO "gardens" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "fefeef"], ["created_at", 2017-05-09 20:40:49 UTC], ["updated_at", 2017-05-09 20:40:49 UTC], ["user_id", 4]]
---
  def create
  	@garden = Garden.new(garden_params)

    if @garden.save