app/controllers/api/garden_controller.rb

  def index
  	@garden = User.find(params[:id]).garden
---
SELECT  "gardens".* FROM "gardens" WHERE "gardens"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]