app/controllers/api/posts_controller.rb

  def index
    @posts = Post.all
    @currentUser = current_user

    user_array = []
    @posts.each { |x| # lol
      user_array.push(User.find(x.user_id))
---
SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def show
    @post = Post.find(params[:id])
    @user = User.find(@post.user_id)
    @comments = @post.comments
    user_array = []
    @comments.each { |x| # lol
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def create
  	@post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "description", "img_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "aaaaa"], ["description", "aaaaa"], ["img_url", "#"], ["created_at", 2017-05-08 21:05:05 UTC], ["updated_at", 2017-05-08 21:05:05 UTC], ["user_id", 4]]

  def update
    # @post = Post.find(params[:id])
    @post = current_user.posts.find(params[:id])

    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 0], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "ddddd"], ["updated_at", 2017-05-09 15:47:16 UTC], ["id", 1]]